Tekla.Structures.Model.Beam
The Beam class represents a single beam in the model.
A beam has a single start and end point.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Point point = new Point(0, 0, 0);
Point point2 = new Point(1000, 0, 0);
Beam beam = new Beam();
beam.StartPoint = point;
beam.EndPoint = point2;
beam.Profile.ProfileString = "HEA400";
beam.Finish = "PAINT";
beam.StartPointOffset = new Offset();
beam.EndPointOffset = new Offset();
bool result = false;
result = beam.Insert();
}
}

Tekla.Structures.Model.Beam.Radius
Radius for curved beam.

Tekla.Structures.Model.Beam.type
Beam type.

Tekla.Structures.Model.Beam.StartPoint
Gets or sets the start point of the beam.

Tekla.Structures.Model.Beam.EndPoint
Gets or sets the end point of the beam.

Tekla.Structures.Model.Beam.StartPointOffset
Gets or sets the beam's start point offset.

Tekla.Structures.Model.Beam.EndPointOffset
Gets or sets the beam's end point offset.

Tekla.Structures.Model.Beam.Type
Gets the read-only type of the beam.
The default type for a new beam instance is beam.

Tekla.Structures.Model.Beam.StartLevelName
Gets or sets the start level name.

Tekla.Structures.Model.Beam.EndLevelName
Gets or sets the end level name.

Tekla.Structures.Model.Beam.StartLevelOffset
Gets or sets the start level offset.

Tekla.Structures.Model.Beam.EndLevelOffset
Gets or sets the end level offset.

Tekla.Structures.Model.Beam.#ctor
Initializes a new instance of the Tekla.Structures.Model.Beam class.
The start and end points are in the origin.

Tekla.Structures.Model.Beam.#ctor(Tekla.Structures.Model.Beam.BeamTypeEnum)
Initializes a new instance of the Tekla.Structures.Model.Beam class by using the defined type.
beamType: The type of the beam.

Tekla.Structures.Model.Beam.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Initializes a new instance of the Tekla.Structures.Model.Beam class with the given start and end points.
startPoint: The start point for the beam.
endPoint: The end point for the beam.

Tekla.Structures.Model.Beam.Insert
Inserts the beam into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.Beam.Select
Selects a beam from the model database. The beam identifier must be set.
Returns: True on success.

Tekla.Structures.Model.Beam.Modify
Modifies the existing beam in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.Beam.Delete
Deletes the beam instance with the given identifier from the model database.
Returns: True on success.